import React from "react";
import s from './docs.module.scss';
import firststepimg from './../../../image/first.png';
import secondstepimg from './../../../image/second.png';
import threestepimg from './../../../image/three.png';


const Docs = () => {
    return(
      <div className={s.wrapper} translate="no">
        <div>
          <h2 >Що це?</h2>
          <p >NASA Everyday - це сервіс, який дозволяє переглядати зображення чи відео різних об'єктів Всесвіту та читати короткі пояснення до них, створені астрономами-професіоналами. Ви можете вибрати дату та переглянути інформацію та візуальний матеріал, що відповідають обраній даті.</p>
        </div>
        <div >
          <h2 >Як працює ця послуга?</h2>
          <ol >
            <li>На панелі навігації виберіть «Застосунок»</li>
            <img className={s.firstimg}  src={firststepimg} alt="first step" />
            <li >Ви зайдете на сторінку «Застосунок», спочатку ви побачите приклад того, як буде виглядати «Стаття», зверніть увагу на нижній правий кут, ви побачите кнопку, натисніть на неї і з’явиться поле вибору дати в центрі екрану.</li>
            <img className={s.secondimg}  src={secondstepimg} alt="second step" />
            <li >Після натискання на поле в центрі з’явиться модальне вікно, в якому ви можете вибрати дату.Після вибору дати вам відразу відобразится «Стаття»</li>
            <img  className={s.threeimg}  src={threestepimg} alt="" />
            <div  role="alert">
              <p >Як закрити модальне вікно?</p>
              <p >Щоб закрити модальне вікно, клацніть будь-де в сірій області, щоб закрити модальне вікно</p>
            </div>
          </ol>
        </div>
        <div >
          <h2 >Можливі помилки</h2>
          <p >На сайті можливі помилки, оскільки проект знаходиться в розробці! Але можливі й інші помилки:</p>
          <ol >
            <li>Якщо ви тривалий час бачите напис "Завантаження...", після вибору дати, то перевірте підключення до інтернету</li>
            <li>Якщо зображення не оновлюється, спробуйте оновити саму сторінку і знову виберіть цю дату, або почекайте.</li>
          </ol>
          <div role="alert" >
            <div >
            УВАГА!
            </div>
            <div >
              <p>Ви не можете вибрати майбутню дату, оскільки в архівах NASA не може бути майбутніх дат.</p>
            </div>
          </div>
        </div>
      </div> 
    );
};

export default Docs;